---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricationServiceName
source: html/fa3d6af4-0fc4-153c-b7d9-6ec99f059ada.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricationServiceName Property

"Fabrication Service Name"

## Syntax (C#)
```csharp
public static ForgeTypeId FabricationServiceName { get; }
```